#This mod will show your level of strength.
#Developer's telegram @ZZZOOOVVV2007
#⠄⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿
#⠄⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⠄⠄⣿
#⣿⠄⠄⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⠄⠄⠄⣿
#⣿⠄⠄⠄⣿⠄⠄⠄⠄⠄⠄⠄⠄⣿⠄⠄⠄⣿
#⣿⠄⠄⠄⠄⣿⠄⠄⠄⠄⠄⠄⠄⣿⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿
#⣿⠄⠄⠄⠄⠄⣿⠄⠄⠄⠄⠄⠄⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿
#⣿⠄⠄⠄⠄⠄⠄⣿⣿⣿⠄⠄⣿⠄⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
#⣿⠄⠄⠄⠄⠄⣿⠄⠄⠄⣿⣿⠄⣿⣿⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿
#⠄⣿⠄⠄⠄⣿⠄⠄⠄⣿⣿⠄⠄⠄⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿
#⠄⠄⣿⠄⠄⣿⠄⠄⣿⠄⠄⠄⣿⠄⠄⠄⠄⠄⣿⠄⠄⠄⣿⣿⣿⣿⠄⣿
#⠄⠄⠄⣿⠄⣿⠄⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⠄⣿
#⣿⣿⣿⠄⠄⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⠄⠄⠄⠄⠄⠄⣿
#⣿⠄⠄⠄⣿⠄⠄⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⠄⠄⠄⠄⣿⠄⠄⣿
#⠄⣿⠄⠄⠄⣿⠄⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿
#⠄⠄⣿⠄⠄⣿⠄⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿
#⠄⠄⠄⣿⠄⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿
#⠄⠄⠄⠄⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⠄⠄⠄⣿
#⠄⠄⠄⠄⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⠄⠄⣿⠄⠄⠄⣿
#⠄⠄⠄⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⠄⠄⠄⠄⣿⣿⣿⣿
#⠄⠄⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿
#⠄⠄⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿
#⠄⠄⣿⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⠄⠄⠄⠄⠄⠄⠄⣿
#⠄⠄⠄⣿⠄⠄⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⠄⠄⠄⠄⣿
#⠄⠄⣿⣿⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿
import random
from hikkatl.tl.types import Message
from .. import loader, utils

@loader.tds
class Potujnometr(loader.Module):
    strings = {
        "name": "Potujnometr",
        "low_power": (
            "⚡ **Рівень потужності:** ⚡\n\n"
            "⬜️🟩🟨🟧🟫🟦🟪⬛️☠️\n"
            "{}🔹\n\n"
            "💤 Ти ще в повному пиздеці, братишка. Потужність — як хуй на сковорідці, ледве гріє!"
        ),
        "mid_power": (
            "🔥 **Рівень пизпотужностідецю:** 🔥\n\n"
            "⬜️🟩🟨🟧🟫🟦🟪⬛️☠️\n"
            "{}🔺\n\n"
            "🌌 Ну вже щось! Ти як пиздець на районі — всі бачать, але ще не ссуться від страху."
        ),
        "high_power": (
            "💥 **Рівень потужності:** 💥\n\n"
            "⬜️🟩🟨🟧🟫🟦🟪⬛️☠️\n"
            "{}💫\n\n"
            "✨ Ого, та ти пиздець який потужний! Всесвіт вже готується наїбнутись від твоєї сили!"
        ),
        "max_power": (
            "☄️ **Рівень потужності:** ☄️\n\n"
            "⬜️🟩🟨🟧🟫🟦🟪⬛️☠️\n"
            "{}☠️\n\n"
            "💀 БЛЯЯЯ, ТИ ПИЗДЕЦЬ ЯКИЙ ТИТАН! Всі галактики в ахуї, тримай цей пиздатий рівень!"
        ),
    }

    @loader.command(ru_doc="Показати рівень потужності")
    async def ptjcmd(self, message: Message):
        dots_count = random.randint(0, 40)
        dots = "💥" * (dots_count // 5) + "🔥" * (dots_count % 5)
        if dots_count <= 10:
            power_message = self.strings("low_power").format(dots)
        elif dots_count <= 20:
            power_message = self.strings("mid_power").format(dots)
        elif dots_count <= 30:
            power_message = self.strings("high_power").format(dots)
        else:
            power_message = self.strings("max_power").format(dots)
        endings = [
            "😂 *Пиздець, сміх і гріх!*",
            "🍺 *За таке треба випити, курва!*",
            "💪 *Тримай хуй в кулаці, ти машина!*",
            "🤯 *Всі в шоці, пизда твоїй скромності!*"
        ]
        power_message += "\n\n" + random.choice(endings)

        await utils.answer(message, power_message)